## This notebook is for my notes on the basics of functions and the `GROUP BY` clause in MySQL

Review Goals:

- Understand the basics of functions within MySQL

- Learn how to use the following numerical functions:

    - `AVG`
    
    - `MIN` 
    
    - `MAX`
    
- Learn the following String functions:

    - `CONCAT`
    
    - `SUBSTR`
    
    - `UPPER`
    
    - `LOWER`
    
    - `REPLACE`
    
- Learn the following Date/Time functions:

    - `NOW`
    
    - `CURDATE`
    
    - `CURTIME`
    
    - `UNIX_TIMESTAMP`
    
- Learn how to `CAST`

Functions are generally pretty straightforward. The Numerical functions work exactly as you would think they do.

Something like:

```sql
SELECT MIN(col_name) 
FROM table_name;
```
Will return a single entry, that being the smallest value from that column and table.

Similarly, the `MAX` will return the maximum value, and looks basically the same:

```sql
SELECT MAX(col_name)
FROM table_name;
```

And yes, `AVG` *functions* the exact same way.

```sql
SELECT AVG(col_name)
FROM table_name;
```

And now, onto string functions. They work in the same way, but can be slightly more complex to use.

Concat simply concatenates any number of strings or column names together, and looks like:

```sql
SELECT CONCAT('Hello, ', 'My ', 'Name ', 'is ', 'Shawn.');
```

The output would look something like this:

|CONCAT('Hello, ', 'My ', 'Name ', 'is ', 'Shawn.')|
|:---------|
|Hello, My Name is Shawn.|
 
A very basic example that you'll likely never actually use, but it displays the syntax simply.


`SUBSTR` works pretty similary, but it takes a part of a string, instead of the whole thing. You need to supply the string you want to manipulate, the starting i ndex (which character to start from), and the length (the number of characters to extract)

```sql
SELECT SUBSTR('agcdefg', 2, 4);
```

This would output something like so:

|SUBSTR('abcdefg', 2, 4)|
|:---------|
|bcde|

The string here is 'abcdefg', and the starting point is the second index, which is 'b', and the number of characters to extract is 4, so it stops after 'e'.

Case conversions (`UPPER` and `LOWER`) work exactly the same way and is a very simple concept, so I'm not going to type out a whole example of it. Just know it takes in a string and either upper or lowercases the whole thing, with the syntax being the same as above.

Replace also works similarly, but is slightly more in depth, so I will type out an example. The syntax is like so:
```sql
SELECT REPLACE(subject, search, replacement)
```
An example would be:

```sql
SELECT REPLACE('abcdefg', 'abc', '123');
```

The output for this would be:

|REPLACE('abcdefg', 'abc', '123')|
|:---------|
|123defg|

Date and Time functions can also be quite useful. One of the most common would be `NOW`, though `CURRENT_TIMESTAMP` does the exact same thing. The syntax for `NOW` is quite simple, and returns the current time back in the `YYYY-MM-DD HH:MM:SS` format. It looks like this:

```sql
SELECT NOW();
```

`CURDATE` is also quite simple. It returns the same as the above, but without the time information. It looks like:

```sql
SELECT CURDATE();
```

`CURTIME` does the exact same thing as `CURDATE` but gives the time instead of the date.

```sql
SELECT CURTIME();
```

The `UNIX_TIMESTAMP` function is used to represent time as an integer. It returns the number of seconds since midnight January 1st, 1970 :shrug: 
If you pass a date/time value to the function, it will give you that number of seconds. A pretty simple example would be:

```sql
SELECT CONCAT('Teaching people to code for ', 
              UNIX_TIMESTAMP() - UNIX_TIMESTAMP('2014-02-04'),
              'seconds');
```

(An example from the Codeup curriculum)

Last, at least for the basics of functions goes, we have `CAST`. It isn't *technically* a function, but it behaves similarly and is useful to know. Casting lets us convert, or cast, one data type into another. For the most part, you can treat a string as a number, or a number as a string, and MySQL will figure it out. So you could do something like:

```sql
SELECT 1 + '4',
       '3' - 2,
       CONCAT('This is a number ', 123);
```
The above will look like so:

|1 + '4'| '3' - 1| CONCAT('This is a number ', 123)|
|:---------|
|I am output|


There is an explicit `CAST` function as well, if you need to be very specific on what you need. The basic syntax is as follows:

```sql
SELECT CAST(123 as CHAR